{
  "main": {
    "name": "Meincken",
    "occupation": "Front End Developer",
    "description": "I build websites and component libraries for pretty much anything.",
    "image": "profilepic.jpg",
    "bio": "I am an experienced AEM Front End Developer. I specialise in creating clean semantic code to ensure fast loadtimes. A champion of atomic design principles and where possible, develop style guides and pattern libraries to ensure consistant and rapid develpment when working as part of a team. I am as comfortable coding in raw HTML as I am using products such as React. I enjoy working as part of an Agile team and have worked on some of the countries largest ecommerce sites.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "nick@meincken.com",
    "address": {
      "city": "London",
      "zip": "KT5 8BB"
    },
    "website": "https://www.meincken.com",
    "resumedownload": "assets/NickMeinckenResume.pdf",
    "resumeonline": "https://nick.meincken.com/cv/index.html"
  },
  "resume": {
    "skillmessage": "I am a competent Front End Developer with good skills with many frameworks and content management systems. Below is my level of competency with various technologies.",
    "work": [
      {
        "company": "Signal Noise",
        "title": "Front End Developer",
        "years": "August 2019 - October 2019",
        "description": "Building AEM components for Siemens using postcss and PatternLab. This project contained the use of Stylelint, PostCSS and BEM within Gulp. It drew in a lot of style rules from other projects created by Signal Noise for Siemens."
      },
      {
        "company": "Pomegranate",
        "title": "Front End Developer",
        "years": "July 2019 - August 2019",
        "description": "Building components around the bootstrap framework for a Medical website utilising Handlebars, LESS and jQuery. Sample components and page templates for a CMS. Built the base for reusable components and sections."
      },
      {
        "company": "BT",
        "title": "Front End Engineer & Email Developer",
        "years": "May 2018 - June 2019",
        "description": "BT is a globally recognized telecoms brand. I have been working as part of the Marketing, Brand and Data teams in rebuilding their email templates in AEM for integration into ACM. My main task has been migrating and updating the email templates within AEM to be responsive with more control for the user. I have also worked on a number microsites for campaigns within ACM (Adobe Campaign)."
      },
      {
        "company": "GTA",
        "title": "Front End UI Developer",
        "years": "January 2018 - May 2018",
        "description": "GTA Travel have been powering global travel for 40 years. I came on board as part of the marketing team to work on marketing projects and general site optimisation. I am also part of a wider group that has been tasked to create new components and develop a style guide for the site."
      },
      {
        "company": "Matter of Form",
        "title": "Front End Developer",
        "years": "May 2017 - October 2017",
        "description": "Working as part of a small agile development team in Old Street on a high quality, design led project updating a boutique travel website. Building on modular patterns for CSS, JS and HTML for a CMS."
      },
      {
        "company": "Merchant Cantos",
        "title": "Front End Developer",
        "years": "January 2017 - February 2017 & March 2017",
        "description": "Working as part of a small development team building custom websites for corporate finance using .Net and Umbraco. I provided support for existing websites and updating an older site to newer code base and cleaning up the HTML."
      },
      {
        "company": "Rapha",
        "title": "Front End Developer",
        "years": "September 2016 - November 2016",
        "description": "Cleaning up the code base of this prestige clothing brand and general site and performance improvements as well as building the new about pages on Wordpress and the updated Cycle Club section."
      },
      {
        "company": "We Are Social",
        "title": "Front End Developer",
        "years": "September 2016",
        "description": "Microsite for Blind Pig Cider using Wordpress with custom fields and utilising a mobile first design principle as well as improving the mixins for SCSS."
      },
      {
        "company": "Virgin Media",
        "title": "Front End Developer",
        "years": "November 2009 - August 2016",
        "description": "One of the UK's leading entertainment and communication providers, I was a member of a team of developers working on moving Virgin Media to a fully responsive website and migrating from multiple instances of CQ5 to a single version of AEM6. First hand experience with AEM adapting many of the core components within AEM to modified and customised versions specifically for Virgin Media, as well as custom components."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Meincken (Personal site)",
        "category": "Personal blog for me, I plan on using this to host my other off web projects in the future and updates on my adventures.",
        "image": "meincken.png",
        "url": "https://meincken.com"
      },
      {
        "title": "Built By Moustache",
        "category": "Company website for my own web services.",
        "image": "bbm-logo.png",
        "url": "https://builtbymoustache.com"
      },
      {
        "title": "Belmond",
        "category": "I built components for this site whilst working for MOF.",
        "image": "belmond-logo.svg",
        "url": "https://belmond.com"
      },
      {
        "title": "BT Business",
        "category": "I have built components for AEM for use in Email and integration into ACM.",
        "image": "bt_logo_white.svg",
        "url": "https://business.bt.com"
      },
      {
        "title": "Blind Pig",
        "category": "Wordpress site for WeAreSocial using a number of technologies.",
        "image": "blind-pig-logo.png",
        "url": "https://blindpigcider.co.uk"
      },
      {
        "title": "Rapha",
        "category": "I worked on a few different sections of this site before the relaunch.",
        "image": "rapha.svg",
        "url": "https://rapha.cc"
      },
      {
        "title": "Virgin Media",
        "category": "I built out a styleguide and pattern library as well as a number of components for AEM6.",
        "image": "virginmedia-logo.png",
        "url": "https://virginmedia.com"
      }
    ]
  }
}
